{"config": {"name": "sequential", "layers": [{"config": {"trainable": true, "name": "masking", "dtype": "float32", "mask_value": 0.0}, "class_name": "Masking"}, {"config": {"unit_forget_bias": true, "recurrent_dropout": 0.5, "time_major": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "unroll": false, "activation": "tanh", "units": 512, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "kernel_constraint": null, "name": "lstm", "stateful": false, "recurrent_constraint": null, "implementation": 1, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dropout": 0.5, "recurrent_activation": "hard_sigmoid", "return_state": false, "return_sequences": false, "bias_constraint": null, "use_bias": true, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "relu", "dtype": "float32", "units": 256, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense", "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout", "rate": 0.5, "dtype": "float32", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "softmax", "dtype": "float32", "units": 101, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "build_input_shape": [null, 40, 1280]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4-tf"}